# Combining DataFrames

### Import pandas

In [14]:
import pandas as pd

### Read CSV

In [15]:
customers = pd.read_csv("cafe_customers.csv")
items = pd.read_csv("cafe_items.csv")
week_1 = pd.read_csv("cafe_week_1_sales.csv")
week_2 = pd.read_csv("cafe_week_2_sales.csv")

In [16]:
customers.head()

,id,first_name,last_name,email,gender,payment
0,1,Rogerio,Sercombe,rsercombe0@utexas.edu,Female,card
1,2,Lauri,Bonicelli,lbonicelli1@123-reg.co.uk,Male,card
2,3,Bethanne,Barendtsen,bbarendtsen2@etsy.com,Female,card
3,4,Derrik,Perroni,dperroni3@smugmug.com,Female,cash
4,5,Kizzee,Plaxton,kplaxton4@fema.gov,Female,gift_certificate

In [17]:
items.head()

   item_id       item  prices
0        1      latte       3
1        2     muffin       4
2        3   lemonade       3
3        4      latte       2
4        5  chocolate       2

In [18]:
week_1.head()

   cust_id  item_id
0      483        1
1      263        1
2      146        1
3      933        4
4      768        3

In [19]:
week_2.head()

   cust_id  item_id
0       20        2
1      407        4
2      607        1
3      329        5
4      874        6